Core/src/Documents/Визит/Визит.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Визит</name>
  <registerRecords>AccountingRegister.AzRyХозрасчетныйUSD</registerRecords>
  <attributes>
    <name>ТорговаяТочка</name>
    <type>
      <types>CatalogRef.ОПТИМУС_ТорговыеТочки</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаПолученная</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидОперации</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтруктурнаяЕдиница</name>
    <type>
      <types>CatalogRef.СтруктурныеЕдиницы</types>
    </type>
  </attributes>
  <attributes>
    <name>ТранспортноеСредство</name>
    <type>
      <types>CatalogRef.ТранспортныеСредства</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>Касса</name>
    <type>
      <types>CatalogRef.Кассы</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидЦен</name>
    <type>
      <types>CatalogRef.ВидыЦен</types>
    </type>
  </attributes>
  <attributes>
    <name>РезервированиеЗапасов</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодарокЗаказа</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодарокРеализации</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НеРедактировать</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидСкидкиНаценки</name>
    <type>
      <types>CatalogRef.ВидыСкидокНаценок</types>
    </type>
  </attributes>
  <attributes>
    <name>СтруктурнаяЕдиницаДляВозврата</name>
    <type>
      <types>CatalogRef.СтруктурныеЕдиницы</types>
    </type>
  </attributes>
  <attributes>
    <name>ПоследняяСинхронизация</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ЗаказПокупателя</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПроцентСкидкиНаценки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Подарок</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ВозвратОтПокупателя</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПроцентСкидкиНаценки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Реализация</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПроцентСкидкиНаценки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Подарок</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ЗаказНаВозврат</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПроцентСкидкиНаценки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ВнутреннийЗаказ</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ВнутреннийЗаказ1</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Core/src/AccumulationRegisters/Продажи/Продажи.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>Продажи</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаНДС</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Себестоимость</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ХозяйственнаяОперация</name>
    <type>
      <types>CatalogRef.ХозяйственныеОперации</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭтоПодарок</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Характеристика</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Партия</name>
    <type>
      <types>CatalogRef.ПартииНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Документ</name>
    <type>
      <types>DocumentRef.РасходнаяНакладная</types>
      <types>DocumentRef.ОтчетКомиссионера</types>
      <types>DocumentRef.ПриходнаяНакладная</types>
      <types>DocumentRef.АктВыполненныхРабот</types>
      <types>DocumentRef.ЧекККМ</types>
      <types>DocumentRef.ОтчетОПереработке</types>
      <types>DocumentRef.АвансовыйОтчет</types>
      <types>DocumentRef.ЗаказПокупателя</types>
      <types>DocumentRef.ПродажаЛицензии</types>
      <types>DocumentRef.ОтчетОРозничныхПродажах</types>
      <types>DocumentRef.ОтчетКомитенту</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СтавкаНДС</name>
    <type>
      <types>CatalogRef.СтавкиНДС</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ЗаказПокупателя</name>
    <type>
      <types>DocumentRef.ЗаказПокупателя</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.СтруктурныеЕдиницы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </dimensions>
  <dimensions>
    <name>AzRyАналитикаКонтрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>AzRyПроект</name>
    <type>
      <types>CatalogRef.Проекты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>AzRyШтрихкодыНоменклатуры</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Проект</name>
    <type>
      <types>CatalogRef.Проекты</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Core/src/Documents/ЗаказНаВозврат/ЗаказНаВозврат.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЗаказНаВозврат</name>
  <registerRecords>AccountingRegister.AzRyХозрасчетныйUSD</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерВходящегоДокумента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаВходящегоДокумента</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ТорговаяТочка</name>
    <type>
      <types>CatalogRef.ОПТИМУС_ТорговыеТочки</types>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументВизита</name>
    <type>
      <types>DocumentRef.Визит</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Запасы</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Core/src/Documents/Визит/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	//--------------------------------------------------------------------------
	// © Шишка В.В. [28 сентября 2023]  НАЧАЛО
	//Документы.Визит.СоздатьСвязанныеДокументы(ЭтотОбъект.Ссылка);
	Перем ОшибкиВозвратаТоваров;
	ДополнительныеСвойства.Свойство("ОшибкиВозвратаТоваров", ОшибкиВозвратаТоваров);
	Документы.Визит.СоздатьСвязанныеДокументы(ЭтотОбъект.Ссылка, ОшибкиВозвратаТоваров);
	// © Шишка В.В. [28 сентября 2023]  КОНЕЦ
	//--------------------------------------------------------------------------
	
	
КонецПроцедуры

//--------------------------------------------------------------------------
// © Шишка В.В. [28 сентября 2023]  НАЧАЛО
Процедура ВыполнитьПроверкуВозвращаемыхТоваров() Экспорт

	УчетнаяПолитика = РегистрыСведений.УчетнаяПолитикаРегл.ПолучитьПоследнее(КонецДня(Дата), Новый Структура("Организация", Организация));
	Если Не УчетнаяПолитика.КонтрольКоличестваПриВозврате ИЛИ УчетнаяПолитика.СрокКонтроляКоличестваПриВозврате = 0 Тогда
	
		ДополнительныеСвойства.Вставить("ОшибкиВозвратаТоваров", Новый Массив);
		ДополнительныеСвойства.Вставить("НеВыполнятьПроверку", Истина);
		Возврат;	
	
	КонецЕсли; 
	ТаблицаВозврата = ЗаказНаВозврат.Выгрузить();
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ЗаказНаВозврат", ТаблицаВозврата);
	//Запрос.УстановитьПараметр("Возврат", ВозвратОтПокупателя.Выгрузить());
	Запрос.УстановитьПараметр("Дата", Дата);
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("Контрагент", Контрагент);
	Запрос.УстановитьПараметр("Договор", Договор);
	Запрос.УстановитьПараметр("КоличествоМесяцевКонтроля", УчетнаяПолитика.СрокКонтроляКоличестваПриВозврате);

	Запрос.Текст =
	"ВЫБРАТЬ
	|	ЗаказНаВозврат.НомерСтроки КАК НомерСтроки,
	|	ВЫРАЗИТЬ(ЗаказНаВозврат.Номенклатура КАК Справочник.Номенклатура) КАК Номенклатура,
	|	ВЫРАЗИТЬ(ЗаказНаВозврат.Характеристика КАК Справочник.ХарактеристикиНоменклатуры) КАК Характеристика,
	|	ЗаказНаВозврат.Количество КАК Количество
	|ПОМЕСТИТЬ ВТ_Возврат
	|ИЗ
	|	&ЗаказНаВозврат КАК ЗаказНаВозврат
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура,
	|	Характеристика
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Возврат.Номенклатура КАК Номенклатура,
	|	ВТ_Возврат.Характеристика КАК Характеристика,
	|	СУММА(ВТ_Возврат.Количество) КАК Количество
	|ПОМЕСТИТЬ ВТ_ВозвратИтог
	|ИЗ
	|	ВТ_Возврат КАК ВТ_Возврат
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_Возврат.Номенклатура,
	|	ВТ_Возврат.Характеристика
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура,
	|	Характеристика
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВложенныйЗапрос.Номенклатура КАК Номенклатура,
	|	ВложенныйЗапрос.Характеристика КАК Характеристика,
	|	СУММА(ВложенныйЗапрос.КоличествоПродано) КАК КоличествоПродано,
	|	СУММА(ВложенныйЗапрос.КоличествоВозвращено) КАК КоличествоВозвращено
	|ПОМЕСТИТЬ ВТ_ПродажиВозвратыПериода
	|ИЗ
	|	(ВЫБРАТЬ
	|		ПродажиОбороты.Номенклатура КАК Номенклатура,
	|		ПродажиОбороты.Характеристика КАК Характеристика,
	|		СУММА(ВЫБОР
	|				КОГДА ПродажиОбороты.Регистратор ССЫЛКА Документ.РасходнаяНакладная
	|					ТОГДА ПродажиОбороты.КоличествоОборот
	|				ИНАЧЕ 0
	|			КОНЕЦ) КАК КоличествоПродано,
	|		СУММА(ВЫБОР
	|				КОГДА ПродажиОбороты.Регистратор ССЫЛКА Документ.ПриходнаяНакладная
	|					ТОГДА -ПродажиОбороты.КоличествоОборот
	|				ИНАЧЕ 0
	|			КОНЕЦ) КАК КоличествоВозвращено
	|	ИЗ
	|		РегистрНакопления.Продажи.Обороты(
	|				ДОБАВИТЬКДАТЕ(&Дата, ДЕНЬ, -1 * &КоличествоМесяцевКонтроля),
	|				КОНЕЦПЕРИОДА(&Дата, ДЕНЬ),
	|				Регистратор,
	|				Организация = &Организация
	|					И Контрагент = &Контрагент
	|					И (ВЫРАЗИТЬ(Документ КАК Документ.РасходнаяНакладная).Договор = &Договор
	|						ИЛИ ВЫРАЗИТЬ(Документ КАК Документ.ПриходнаяНакладная).Договор = &Договор)
	|					И (Номенклатура, Характеристика) В
	|						(ВЫБРАТЬ
	|							ВТ_ВозвратИтог.Номенклатура КАК Номенклатура,
	|							ВТ_ВозвратИтог.Характеристика КАК Характеристика
	|						ИЗ
	|							ВТ_ВозвратИтог КАК ВТ_ВозвратИтог)) КАК ПродажиОбороты
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ПродажиОбороты.Номенклатура,
	|		ПродажиОбороты.Характеристика) КАК ВложенныйЗапрос
	|
	|СГРУППИРОВАТЬ ПО
	|	ВложенныйЗапрос.Номенклатура,
	|	ВложенныйЗапрос.Характеристика
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура,
	|	Характеристика
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Возврат.НомерСтроки КАК НомерСтроки,
	|	ВТ_Возврат.Номенклатура.Наименование КАК Номенклатура,
	|	ЕСТЬNULL(ВТ_Возврат.Характеристика.Наименование, """") КАК Характеристика,
	|	ВТ_Возврат.Количество КАК Количество,
	|	ВТ_ВозвратИтог.Количество КАК КоличествоИтого,
	|	ЕСТЬNULL(ВТ_ПродажиВозвратыПериода.КоличествоПродано, 0) - ЕСТЬNULL(ВТ_ПродажиВозвратыПериода.КоличествоВозвращено, 0) КАК КоличествоРазницаПродаж,
	|	ЕСТЬNULL(ВТ_ПродажиВозвратыПериода.КоличествоПродано, 0) КАК КоличествоПродано,
	|	ЕСТЬNULL(ВТ_ПродажиВозвратыПериода.КоличествоВозвращено, 0) КАК КоличествоВозвращено
	|ИЗ
	|	ВТ_Возврат КАК ВТ_Возврат
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ВозвратИтог КАК ВТ_ВозвратИтог
	|		ПО ВТ_Возврат.Номенклатура = ВТ_ВозвратИтог.Номенклатура
	|			И ВТ_Возврат.Характеристика = ВТ_ВозвратИтог.Характеристика
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ПродажиВозвратыПериода КАК ВТ_ПродажиВозвратыПериода
	|		ПО ВТ_Возврат.Номенклатура = ВТ_ПродажиВозвратыПериода.Номенклатура
	|			И ВТ_Возврат.Характеристика = ВТ_ПродажиВозвратыПериода.Характеристика
	|ГДЕ
	|	ЕСТЬNULL(ВТ_ПродажиВозвратыПериода.КоличествоПродано, 0) - ЕСТЬNULL(ВТ_ПродажиВозвратыПериода.КоличествоВозвращено, 0) < ВТ_ВозвратИтог.Количество";
	
	Выборка = Запрос.Выполнить().Выбрать();
	МассивОшибок = Новый Массив;
	МассивСтрокНаУдаление = Новый Массив;
	Пока Выборка.Следующий() Цикл
	
		СтруктураСтрока = Новый Структура("НомерСтроки, Номенклатура, Характеристика, Количество, КоличествоИтого, КоличествоРазницаПродаж, КоличествоПродано, КоличествоВозвращено"
								, Выборка.НомерСтроки
								, Выборка.Номенклатура
								, Выборка.Характеристика
								, Выборка.Количество
								, Выборка.КоличествоИтого
								, Выборка.КоличествоРазницаПродаж
								, Выборка.КоличествоПродано
								, Выборка.КоличествоВозвращено
								);
		МассивОшибок.Добавить(СтруктураСтрока);
		МассивСтрокНаУдаление.Добавить(ЗаказНаВозврат[Выборка.НомерСтроки - 1]);
	
	КонецЦикла;
	Если МассивОшибок.Количество() Тогда
		
		ДополнительныеСвойства.Вставить("ОшибкиВозвратаТоваров", МассивОшибок);
		Для каждого ТекЭлемент Из МассивСтрокНаУдаление Цикл
		
			ЗаказНаВозврат.Удалить(ТекЭлемент);		
		
		КонецЦикла; 
		
	КонецЕсли; 

КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если НЕ ДополнительныеСвойства.Свойство("НеВыполнятьПроверкуВозврата") Тогда
	
		УдалитьДвиженияПозаявкамНаВозвратПодчиненныхДокументов();
		ВыполнитьПроверкуВозвращаемыхТоваров();	
	
	КонецЕсли; 
	Если ЭтоНовый() И ( 
		ЗаказПокупателя.Количество() 
		+ ВозвратОтПокупателя.Количество() 
		+ Реализация.Количество() 
		+ ЗаказНаВозврат.Количество() 
		+ ВнутреннийЗаказ.Количество()
		+ ВнутреннийЗаказ1.Количество()) = 0
		И НЕ(ОбменДанными.Загрузка) // Kuzmich, 14.04.2024, (ONESOFT-3020) ხარვეზი დისტრიბუციის აპლიკაციიდან ფულის დოკუმენტის შექმნისას
		Тогда
	
		Отказ = Истина;
	
	КонецЕсли; 
	
КонецПроцедуры

Процедура УдалитьДвиженияПозаявкамНаВозвратПодчиненныхДокументов() Экспорт

	Если НЕ ЭтоНовый() Тогда
		
		УстановитьПривилегированныйРежим(Истина);
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗаказНаВозврат.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.ЗаказНаВозврат КАК ЗаказНаВозврат
		|ГДЕ
		|	ЗаказНаВозврат.ДокументВизита = &ДокументВизита
		|	И ЗаказНаВозврат.Проведен
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ПриходнаяНакладная.Ссылка
		|ИЗ
		|	Документ.ПриходнаяНакладная КАК ПриходнаяНакладная
		|ГДЕ
		|	ПриходнаяНакладная.ДокументВизита = &ДокументВизита
		|	И ПриходнаяНакладная.Проведен";
		
		Запрос.УстановитьПараметр("ДокументВизита", Ссылка);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		Выборка = РезультатЗапроса.Выбрать();
		
		Пока Выборка.Следующий() Цикл
			
			НаборЗаписей = РегистрыНакопления.ЗаявкиНаВозврат.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.Регистратор.Установить(Выборка.Ссылка);
			НаборЗаписей.Прочитать();
			НаборЗаписей.Очистить();
			НаборЗаписей.Записать();
			Если ТипЗнч(Выборка.Ссылка) = Тип("ДокументСсылка.ПриходнаяНакладная") Тогда
			
				НаборЗаписей = РегистрыНакопления.Продажи.СоздатьНаборЗаписей();
				НаборЗаписей.Отбор.Регистратор.Установить(Выборка.Ссылка);
				НаборЗаписей.Прочитать();
				НаборЗаписей.Очистить();
				НаборЗаписей.Записать();
			
			КонецЕсли; 
			
		КонецЦикла;
		УстановитьПривилегированныйРежим(Ложь);
		
	КонецЕсли; 	

КонецПроцедуры
 
 	
// © Шишка В.В. [28 сентября 2023]  КОНЕЦ
//--------------------------------------------------------------------------
